Revit 2027 API
SpatialElement.SpatialElementType Property
 The spatial element type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SpatialElementType SpatialElementType { get; }
Public ReadOnly Property SpatialElementType As SpatialElementType
	Get
public:
property SpatialElementType SpatialElementType {
	SpatialElementType get ();
}
member SpatialElementType : SpatialElementType with get
Property Value
SpatialElementType
See Also
Reference
SpatialElement Class
Autodesk.Revit.DB Namespace